{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jack/git_repos/metricsinstata/docs/part1/part1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Mar 2020, 21:15:48
{txt}
{com}. //_1
. /* Lalonde analysis
> Jack Blundell
> */
. //_2
. /*
> Worked example of analysis of lalonde 1986 data.
> Structure:
> 0. Setup
> 1. Import data
> 2. Rename and relabel variables
> */    
. //_3
. clear
{txt}
{com}. //_4
. set more off
{txt}
{com}. //_5
. cd "~/git_repos/metricsinstata/docs/part1"
{res}/Users/jack/git_repos/metricsinstata/docs/part1
{txt}
{com}. //_6
. // capture log close
. //_7
. //log using "lecture1log", replace
. //_8
. use "nsw.dta"
{txt}
{com}. //_9
. describe

{txt}Contains data from {res}nsw.dta
{txt}  obs:{res}           722                          
{txt} vars:{res}            10                          18 May 2012 09:35
{txt} size:{res}        20,938                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:data_id        }{txt}{bind: str14   }{bind:{txt}%14s      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:treat          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:education      }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:black          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hispanic       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:married        }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:nodegree       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:re75           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:re78           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 

{com}. //_10
. rename treat banana
{res}{txt}
{com}. //_11
. rename banana treat
{res}{txt}
{com}. //_12
. label variable treat "Treatment indicator"
{txt}
{com}. //_13
. des

{txt}Contains data from {res}nsw.dta
{txt}  obs:{res}           722                          
{txt} vars:{res}            10                          18 May 2012 09:35
{txt} size:{res}        20,938                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:data_id        }{txt}{bind: str14   }{bind:{txt}%14s      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:treat          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Treatment indicator{p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:education      }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:black          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:hispanic       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:married        }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:nodegree       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:re75           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:re78           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_14
. //log close
. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/jack/git_repos/metricsinstata/docs/part1/part1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Mar 2020, 21:15:48
{txt}{.-}
{smcl}
{txt}{sf}{ul off}