{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jack/git_repos/metricsinstata/docs/part3/part3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Mar 2020, 21:16:35
{txt}
{com}. //_1
. cd "~/git_repos/metricsinstata/docs/part3"
{res}/Users/jack/git_repos/metricsinstata/docs/part3
{txt}
{com}. //_2
. use "nsw.dta", clear
{txt}
{com}. //_3
. hist re75
{txt}(bin={res}26{txt}, start={res}0{txt}, width={res}1439.6792{txt})
{res}{txt}
{com}. graph export "hist_re75.png", replace
{txt}(file hist_re75.png written in PNG format)

{com}. //_4
. graph box re75, by(treat)
{res}{txt}
{com}. graph export "box_re78_byt.png", replace
{txt}(file box_re78_byt.png written in PNG format)

{com}. //_5
. sum re78 if treat == 1, det

                            {txt}re78
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        297
{txt}25%    {res} 549.2984              0       {txt}Sum of Wgt. {res}        297

{txt}50%    {res} 4232.309                      {txt}Mean          {res} 5976.352
                        {txt}Largest       Std. Dev.     {res} 6923.796
{txt}75%    {res} 9381.295        26817.6
{txt}90%    {res} 13626.04       34099.28       {txt}Variance      {res} 4.79e+07
{txt}95%    {res} 17685.18       36646.95       {txt}Skewness      {res} 2.646437
{txt}99%    {res} 34099.28       60307.93       {txt}Kurtosis      {res} 16.72786
{txt}
{com}. sum re78 if treat == 0, det

                            {txt}re78
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        425
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}        425

{txt}50%    {res} 3746.701                      {txt}Mean          {res} 5090.048
                        {txt}Largest       Std. Dev.     {res} 5718.089
{txt}75%    {res} 8329.823       23483.45
{txt}90%    {res} 12429.91       29408.04       {txt}Variance      {res} 3.27e+07
{txt}95%    {res} 16328.96        30247.5       {txt}Skewness      {res} 1.569358
{txt}99%    {res} 20942.24       39483.53       {txt}Kurtosis      {res} 6.963969
{txt}
{com}. //_6
. twoway scatter re78 re75
{res}{txt}
{com}. graph export "scatter_re75re78.png", replace
{txt}(file scatter_re75re78.png written in PNG format)

{com}. //_7
. binscatter re78 re75
{res}{txt}warning: nquantiles(20) was specified, but only 13 were generated. see help file under nquantiles() for explanation.
{res}{txt}
{com}. graph export "binscatter_re75re78.png", replace
{txt}(file binscatter_re75re78.png written in PNG format)

{com}. //_8
. twoway scatter re78 re75, mcolor(blue%50) ///
> graphregion(color(white)) ///
> xtitle("Earnings in $1,000's (1978)") ytitle("Earnings in $1,000's (1975)")
{res}{txt}
{com}. //_9
. graph export "scattermod_re75re78.png", replace
{txt}(file scattermod_re75re78.png written in PNG format)

{com}. //_10
. twoway (scatter re78 re75 if treat == 1, mcolor(blue%50)) ///
> (scatter re78 re75 if treat == 0, mcolor(dkorange%50)), ///
> legend(label(1 "Treatment") label(2 "Control")) ///
> graphregion(color(white)) ///
> xtitle("Earnings $1,000's (1978)") ytitle("Earnings $1,000's (1975)")
{res}{txt}
{com}. graph export "scattermodcombined_re75re78.png", replace
{txt}(file scattermodcombined_re75re78.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/jack/git_repos/metricsinstata/docs/part3/part3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Mar 2020, 21:16:46
{txt}{.-}
{smcl}
{txt}{sf}{ul off}